tutorials/multiphase/interHFDIBFoam/particleFromAirToWater/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    "alpha.water.*"
    {
        nAlphaCorr      2;
        nAlphaSubCycles 1;
        cAlpha          1;

        MULESCorr       yes;
        nLimiterIter    5;

        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-08;
        relTol          0;
    }
    
    
    "(p_rgh|pcorr)"
    {
        solver          GAMG;
        tolerance       1e-08;
        relTol          0.1;
        smoother        symGaussSeidel;
        nPreSweeps      0;
        nPostSweeps     2;
        nFinestSweeps   2;
        cacheAgglomeration true;
        nCellsInCoarsestLevel 5;
        agglomerator    faceAreaPair;
        mergeLevels     1;
    }

    "(p_rghFinal|pcorrFinal)"
    {
        $p_rgh;
        tolerance       1e-12;
        relTol          0;
    }

    "(U|k|epsilon|omega|R|nuTilda)"
    {
        solver          PBiCGStab;
        preconditioner   DILU;
        tolerance       1e-12;
        relTol          0.05;
    }
    "(U|k|epsilon|omega|R|nuTilda)Final"
    {
        solver          PBiCGStab;
        preconditioner   DILU;
        tolerance       1e-12;
        relTol          0;
    }
}

PISO
{
    nCorrectors     4;
    nNonOrthogonalCorrectors 0;
    pRefCell        0;
    pRefValue       0;
}

PIMPLE
{
    momentumPredictor   no;
    nOuterCorrectors    2;
    nCorrectors         3;
    nNonOrthogonalCorrectors 0;
    pRefCell 0;
    pRefValue 0;
    
    //~ consistent         no;
    consistent         yes;
    
    residualControl
    {
        p
        {
            //~ tolerance   1e-06;
            tolerance   1e-04;
            relTol      0;
        }
    }
}

relaxationFactors
{
    fields
    {
        p           1.0;
        pFinal      1.0;
    }
    equations
    {
        ".*" 1;
    }
}

cache
{
    grad(U);
}
// ************************************************************************* //
